OptoLAB/FT800-Demo-for-PIC32-and-STM32/FT800 MINI PIC32MX/FT800_MINI_PIC32MX.X/src/main.c
/* 
 * Author: Jovan
 */
#include "CPUConfig.h"
#include <xc.h>

#include "FT800_Graphics.h"
#include "FT800_Colors.h"
#include "FT800_Audio.h"
#include "FT800_SD.h"
#include "ff.h"

#include <sys/attribs.h>
#include "string.h"
#include <stdio.h>

//MINI BOARD BUILTIN LEDs
#define DATA_LED_IO TRISDbits.TRISD6=0
#define STAT_LED_IO TRISGbits.TRISG6=0 // USED AS SCK2
#define DATA_LED(bit) LATDbits.LATD6=bit 
#define STAT_LED(bit) LATGbits.LATG6=bit // USED AS SCK2
//OPTOLAB BOARD BUILTIN LEDs
#define D5_LED_IO TRISEbits.TRISE0=0
#define D6_LED_IO TRISEbits.TRISE1=0
#define D5_LED(bit) LATEbits.LATE0=bit 
#define D6_LED(bit) LATEbits.LATE1=bit 
//--------------------------------------

#define MAIN_MENU   (0x01|0x80)
#define PRIMITIVES  (0x02|0x80)
#define BARS        (0x03|0x80)
#define KNOBS       (0x04|0x80)
#define GRADIENT    (0x05|0x80)
#define KEYS        (0x06|0x80)
#define SOUND       (0x07|0x80)
#define BMP         (0x08|0x80)
#define WAV         (0x09|0x80)
#define JPG         (0x0A|0x80)
#define TRANSFORM   (0x0B|0x80)
#define SKETCH      (0x0C|0x80)
#define SCRSAVER    (0x0D|0x80)

#define SLIDER      0x01
#define SCROLL_V    0x02
#define SCROLL_H    0x03
#define DIAL        0x04
#define TOGGLE      0x05
#define KEY         0x06
#define NOTES       0x07
#define SLIDER1     0x08
#define BACKWARD    0x09
#define FORWARD     0x0A
#define NEXT        0x0B
#define PREVIOUS    0x0C
#define PLAY        0x0D
#define SLIDER2     0x0E
#define SCROLL_S    0x0F
#define SCROLL_R    0x10
FATFS Fatfs;
char chipid = 0, touched =0;

uint8_t menu=MAIN_MENU, previous_menu=MAIN_MENU, tag;
uint16_t tag_value;


//object variables
uint16_t slider_value=500, scroll_v_value=128, scroll_h_value=256, dial_value=0, toggle_value=0, key_value, prev_key_value;
uint16_t ms=0,sec=0,min=59,hour=11;
uint8_t mute=0;

char path[20]={0};

//BMP variables
#define NUM_OF_BMPS 5
const char *bmp_folder="BMP";
const char *bmps[NUM_OF_BMPS]={"im1.bmp","im2.bmp","im3.bmp","im4.bmp","im5.bmp"};
uint8_t bmp_num=1;


//BMP variables
#define NUM_OF_JPGS 5
const char *jpg_folder="JPG";
const char *jpgs[NUM_OF_JPGS]={"jpg1.jpg","jpg2.jpg","jpg3.jpg","jpg4.jpg","jpg5.jpg"};
uint8_t jpg_num=1;        
 
int16_t scale_factor=0, rotate_factor=0;
uint16_t img_width, img_height;
uint8_t img_bytes;

//WAV variables
#define NUM_OF_WAVS 4
const char *wav_folder="WAV";
const char *wavs[NUM_OF_WAVS]={"bells.wav", "dixie.wav","laugh.wav","cowboy.wav"};
uint16_t wav_format, wav_channels, wav_bpc;
uint32_t wav_sample_rate, wav_size;
uint8_t wav_num=0;

uint8_t new_file=0; 

char wallpaper[20];
char wallpaper_folder[20];

//interrupt 
void __ISR(_EXTERNAL_0_VECTOR, IPL7SOFT) EXTI0_ISR(void){
    touched = 1;
    IFS0bits.INT0IF = 0;
}

void Init(void)
{ 
    //Test LEDs
    DATA_LED_IO;
    STAT_LED_IO;
    D5_LED_IO;
    D6_LED_IO;
    DATA_LED(1); STAT_LED(1); 
    D5_LED(1); D6_LED(1);
    delay_ms(1000);
    DATA_LED(0); STAT_LED(0); // STAT is used as SCK2
    D5_LED(0); D6_LED(0);
    
    asm volatile("di");         // Disable all interrupts
   
    CHECONbits.DCSZ = 3;        //Data Cache Size in Lines bits - enable data caching with 4 lines
    CHECONbits.PFMWS = 7;       //PFM Access Time Defined in Terms of SYSLK Wait States bit - 2 wait states
    CHECONbits.PREFEN = 3;      //Enable predictive prefetch for both cacheable and non-cacheable regions
    BMXCONbits.BMXWSDRM = 1;    //Data RAM accesses from CPU have zero wait states for address setup
    INTCONbits.MVEC = 1;        //Interrupt controller configured for Multi-vector mode
    DDPCONbits.JTAGEN = 0;      //Disable the JTAG port
    AD1PCFG = 0xFFFF;
    
    asm volatile("ei");         // Enable all interrupts 
}

uint8_t getNote(char key)
{
    uint8_t note=0;
    
    if(key=='C')note=72;
    if(key=='c')note=73;
    if(key=='D')note=74;
    if(key=='d')note=75;  
    if(key=='E')note=76;  
    if(key=='F')note=77;  
    if(key=='f')note=78;  
    if(key=='G')note=79;  
    if(key=='g')note=80;  
    if(key=='A')note=81;  
    if(key=='a')note=82;
    if(key=='B')note=83;  
    
    return note;
}

void main(void) 
{
    Init();
    FT800_init();
    delay_ms(500);
    disk_initialize(0);
    f_mount(&Fatfs,"",0);
    delay_ms(50);
    FT800_drawLogo();  
    FT800_waitLogo();
    
    FT800_startNewList(); 
    FT800_setBackgroundColor(DARKGRAY);
    FT800_clear(CLEAR_ALL);
    FT800_runTouchCalibration();
    FT800_endOfList();
    
    strcpy(wallpaper_folder,bmp_folder);
    strcpy(wallpaper,bmps[4]);
    sprintf((char*)path, "%s/%s",wallpaper_folder, wallpaper);  
    FT800_loadBMPfromSD(0,path, &img_width, &img_height, &img_bytes);
    while(1)
    {
        switch(menu)
        {
            case MAIN_MENU:

                if(previous_menu==WAV||previous_menu==TRANSFORM||previous_menu==SCRSAVER||previous_menu==SKETCH)
                {
                    FT800_finishList();
                    FT800_startNewList();
                    FT800_setBackgroundColor(BLACK);
                    FT800_clear(CLEAR_ALL);
                    FT800_stop();
                    FT800_endOfList();
                    sprintf((char*)path, "%s/%s",wallpaper_folder, wallpaper);  
                    if(!strcmp(wallpaper_folder,bmp_folder))
                        FT800_loadBMPfromSD(0,path, &img_width, &img_height, &img_bytes);
                    else
                        FT800_loadJPGfromSD(0,path,&img_width,&img_height);
                }
                previous_menu=MAIN_MENU;
                
                
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(BLACK);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                FT800_bitmapSource(0);      
                FT800_bitmapLayout(RGB565, img_width*img_bytes, img_height);   
                FT800_bitmapSize(NEAREST,BORDER,BORDER, img_width, img_height); 
                FT800_bitmapBegin(); 
                FT800_Vertex2II(0,0,0,0);  

                FT800_setColorA(50);
                FT800_drawScrollBar(450, 20, 20, 200, DARKGRAY, WHITE, OPT_3D, scroll_v_value, 28, 256, SCROLL_V);
                FT800_drawScrollBar(20, 240, 400, 20, DARKGRAY, WHITE, OPT_3D, scroll_h_value, 28, 512, SCROLL_H);
                int16_t x0=scroll_h_value-256;
                int16_t y0=scroll_v_value-128;
                FT800_drawScissorXY(0, 0);
                FT800_drawScissorSize(440, 230);
                FT800_setColorA(200);
                FT800_drawButton(10+x0,10+y0,100,60,HOTPINK,23,OPT_3D,"Primitives",BLACK, PRIMITIVES);
                FT800_drawButton(150+x0,10+y0,100,60,LIMEGREEN,23,OPT_3D,"Bars",BLACK, BARS);     
                FT800_drawButton(290+x0,10+y0,100,60,TOMATO,23,OPT_3D,"Knobs",BLACK, KNOBS);      
                FT800_drawButton(10+x0,90+y0,100,60,INDIGO,23,OPT_3D,"Toggle",WHITE, GRADIENT);
                FT800_drawButton(150+x0,90+y0,100,60,GOLD,23,OPT_3D,"Keys",BLACK, KEYS);  
                FT800_drawButton(290+x0,90+y0,100,60,CRIMSON,23,OPT_3D,"Sound",WHITE, SOUND); 
                FT800_drawButton(10+x0,170+y0,100,60,YELLOWGREEN,23,OPT_3D,"BMP",BLACK, BMP); 
                FT800_drawButton(150+x0,170+y0,100,60,PLUM,23,OPT_3D,"WAV",BLACK, WAV); 
                FT800_drawButton(290+x0,170+y0,100,60,AQUAMARINE,23,OPT_3D,"JPG",BLACK, JPG); 
                FT800_drawButton(10+x0,250+y0,100,60,KHAKI,23,OPT_3D,"Transform",BLACK, TRANSFORM); 
                FT800_drawButton(150+x0,250+y0,100,60,TURQUOISE,23,OPT_3D,"Sketch",BLACK, SKETCH); 
                FT800_drawButton(290+x0,250+y0,100,60,VIOLET,23,OPT_3D,"Scr. Saver",BLACK, SCRSAVER); 
                FT800_setColorA(255);


                FT800_endOfList();
                break;
            case PRIMITIVES:
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(DARKGRAY);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                
                unsigned short xs[10]={0, 50, 100, 150, 200, 250, 300, 350, 400, 472};
                unsigned short ys[10]={0, 200, 10, 50, 100, 150, 20, 40, 100, 0}; 
                FT800_drawEdgeLineStrip(xs, ys, 10, 'A', DARKGRAY);
                FT800_drawEdgeLineStrip(xs, ys, 10, 'B', LIGHTGRAY);
                FT800_drawLineStrip(xs, ys, 10,BLACK,80);
                FT800_drawPoint(300, 136, YELLOW, 1000);
                FT800_drawLine(30,50,400,200,BLUE,320);
                FT800_setColorA(150);
                FT800_drawRectangle(10,100,200,200,GREEN,40);
                FT800_drawPoint(400, 220, RED, 400);
                FT800_setColorA(255);
                FT800_drawLine(30,250,400,50,CYAN,80);
                FT800_drawChar(310,200,25,MAGENTA,'A');
                FT800_drawChar(330,200,31,MAGENTA,'A');
                
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 primitives: points, lines, rectangles");   
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                
                FT800_endOfList();
                break;
            case BARS:
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(DARKGRAY);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                
                FT800_drawProgressBar(20, 200, 440, 20, OPT_3D, slider_value, 1024, GREEN, LIGHTGRAY,0);
                FT800_drawDecimalNumb(200, 120, 31, OPT_FLAT, slider_value, YELLOW);
                FT800_drawSlider(20, 60, 440, 20, OPT_3D, slider_value, 1024, BLUE, WHITE, WHITE, SLIDER);
                
