OptoLAB/FT800-Demo-for-PIC32-and-STM32/FT800 MINI PIC32MX/FT800_MINI_PIC32MX.X/src/main.c
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 slider & progress bar"); 
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                
                FT800_endOfList();
                break;                
            case KNOBS:
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(DARKGRAY);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                
                FT800_drawDial(85, 110, 65, OPT_3D, dial_value, BLUE, YELLOW, DIAL);
                FT800_drawGauge(235, 110, 65, OPT_3D, 5, 5, dial_value>>6, 1024, ORANGE, DARKGRAY,0);
                FT800_drawClock(385, 110, 65, RED, OPT_3D, hour, min, sec, ms, WHITE,0);
                FT800_drawDecimalNumb(200, 210, 31, OPT_FLAT, dial_value>>6, YELLOW);
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 dial, gauge & clock"); 
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                
                FT800_endOfList();
                break;
            case GRADIENT:
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(DARKGRAY);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
  
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 Gradient and Toggle"); 
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                uint32_t c1, c2;
                if(toggle_value>32768)
                {
                    FT800_drawToggle(50, 90, 50, 28, OPT_3D, 65535, "on", DARKGRAY, ORANGE, BLACK,TOGGLE);
                    c1=RED;
                    c2=GREEN;
                }
                else 
                {
                    FT800_drawToggle(50, 90, 50, 28, OPT_3D, 0, "off", DARKGRAY, ORANGE, BLACK,TOGGLE);
                    c1=GREEN;
                    c2=RED;
                }
                FT800_drawScissorXY(30, 150);
                FT800_drawScissorSize(410, 90);
                FT800_drawGradient(30, 150, c1, 440, 150, c2);

                FT800_endOfList();             
                break;                
            case KEYS:
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(DARKGRAY);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                
                key_value=FT800_Read8(REG_TOUCH_TAG);
                FT800_drawKeys(30, 150, 400, 50, LIGHTGRAY, 25, key_value, "ABCDEFGH", BLUE, KEYS);
                FT800_drawKeys(55, 202, 350, 50, LIGHTGRAY, 25, key_value, "1234567", BLUE, KEYS);
                if(key_value)FT800_drawChar(220,50,31,ORANGE,key_value);
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 keys"); 
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                
                FT800_endOfList();
                break;
            case SOUND:
                FT800_finishList();
                FT800_startNewList(); 
                FT800_setBackgroundColor(DARKGRAY);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                mute=1;
                
                prev_key_value=key_value;
                key_value=FT800_Read8(REG_TOUCH_TAG);

                FT800_drawKeys(30, 170, 410, 100, WHITE, 25, key_value, "CDEFGAB", BLACK, NOTES);
                FT800_drawKeys(30+30, 130, 110, 60, BLACK, 25, key_value, "cd", WHITE, NOTES);
                FT800_drawKeys(30+180+30, 130, 156, 60, BLACK, 25, key_value, "fga", WHITE, NOTES);
                if(key_value)FT800_drawChar(350,30,31,ORANGE,key_value);
                FT800_drawText(40, 60, 18, ORANGE, OPT_FLAT, "Volume"); 
                FT800_drawSlider(40, 90, 390, 10, OPT_3D, slider_value, 1024, ORANGE, DARKGRAY, WHITE, SLIDER1);

                
                FT800_setSoundVolume(slider_value>>2); 
                if(key_value!=prev_key_value)
                {
                    
                    if(key_value)
                        FT800_setSoundEffect(getNote(key_value),0x02);
                    else 
                        FT800_setSoundEffect(getNote(key_value),0x00);
                    FT800_playSound(1);
                    
                }
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 sound synthesizer"); 
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                    

                FT800_endOfList();
                break;
            case BMP:
                if((previous_menu==MAIN_MENU)||new_file)
                {
                    new_file=0;
                    FT800_finishList();
                    FT800_startNewList();
                    FT800_setBackgroundColor(BLACK);
                    FT800_clear(CLEAR_ALL);
                    FT800_drawText(205, 20, 23, WHITE, OPT_FLAT, "Loading..."); 
                    FT800_drawAnimSpinner(240,136,0,1);
                    FT800_endOfList();
                    sprintf((char*)path, "%s/%s",bmp_folder, bmps[bmp_num]);   
                    FT800_loadBMPfromSD(0,path , &img_width, &img_height, &img_bytes);
                    strcpy(wallpaper_folder,bmp_folder);
                    strcpy(wallpaper,bmps[bmp_num]);
                }
                previous_menu=BMP;

                FT800_finishList();
                FT800_startNewList();
                FT800_setBackgroundColor(BLACK);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);

                FT800_bitmapSource(0);      
                FT800_bitmapLayout(RGB565, img_width*img_bytes, img_height);   
                FT800_bitmapSize(NEAREST,BORDER,BORDER, img_width, img_height); 
                FT800_bitmapBegin(); 
                FT800_Vertex2II(0,0,0,0);  
          
                FT800_setColorA(100);
                FT800_drawButton(445,5,30,30,LIGHTGRAY,28,OPT_3D,"X",BLACK, MAIN_MENU);
                FT800_drawButton(190,230,40,40,LIGHTGRAY,30,OPT_3D,"<",BLACK, BACKWARD);
                FT800_drawButton(250,230,40,40,LIGHTGRAY,30,OPT_3D,">",BLACK, FORWARD);
                FT800_setColorA(255);

                FT800_endOfList();
                break;
            case WAV: 
                if(previous_menu==MAIN_MENU)
                {   
                    FT800_finishList();
                    FT800_startNewList();
                    FT800_setBackgroundColor(BLACK);
                    FT800_clear(CLEAR_ALL);
                    FT800_endOfList();
                    sprintf((char*)path, "%s/%s",wav_folder, wavs[wav_num]); 
                    FT800_loadWAVfromSD(0, path, &wav_format, &wav_channels, &wav_sample_rate, &wav_bpc, &wav_size); 
                    FT800_setPlaybackVolume(128);
                    slider_value=512;
                }
                previous_menu=WAV;
                
                if(new_file)
                {
                    new_file=0;
                    sprintf((char*)path, "%s/%s", wav_folder, wavs[wav_num]); 
                    FT800_loadWAVfromSD(0, path, &wav_format, &wav_channels, &wav_sample_rate, &wav_bpc, &wav_size);
                }
                
                FT800_finishList();
                FT800_startNewList();
                FT800_setBackgroundColor(ORANGE);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                FT800_drawText(10, 10, 18, BLACK, OPT_FLAT, wavs[wav_num]); 
                FT800_drawText(20, 30, 18, DARKGRAY, OPT_FLAT, "FORMAT:  (0-PCM, 1-uLAW, 2-ADPCM)"); 
                FT800_drawText(20, 50, 18, DARKGRAY, OPT_FLAT, "CHANNELS:  (1-MONO, 2-STEREO)");
                FT800_drawText(20, 70, 18, DARKGRAY, OPT_FLAT, "SAMPLE RATE [Hz]:");
                FT800_drawText(20, 90, 18, DARKGRAY, OPT_FLAT, "BITS:");
                FT800_drawText(20, 110, 18, DARKGRAY, OPT_FLAT, "BYTES[KB]:     (MAX 256)"); 
                FT800_drawDecimalNumb(80, 30, 18, OPT_FLAT, wav_format, BLACK);
                FT800_drawDecimalNumb(95, 50, 18, OPT_FLAT, wav_channels, BLACK);
                FT800_drawDecimalNumb(160, 70, 18, OPT_FLAT, wav_sample_rate, BLACK);
                FT800_drawDecimalNumb(65, 90, 18, OPT_FLAT, wav_bpc, BLACK);
                FT800_drawDecimalNumb(95, 110, 18, OPT_FLAT, wav_size>>10, BLACK);
                
                FT800_drawSlider(40, 160, 390, 10, OPT_3D, slider_value, 1024, DARKGRAY, LIGHTGRAY, WHITE, SLIDER2);
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);
                FT800_drawButton(170,200,60,60,DARKGRAY,30,OPT_3D,"<",ORANGE, PREVIOUS);
                FT800_drawButton(260,200,60,60,DARKGRAY,30,OPT_3D,">",ORANGE, NEXT);
                FT800_drawButton(320,70,100,60,DARKGRAY,28,OPT_3D,"PLAY",ORANGE, PLAY);
                
                FT800_endOfList();
                break;   
            case JPG: 
                if((previous_menu==MAIN_MENU)||new_file)
                {
                    new_file=0;
                    FT800_finishList();
                    FT800_startNewList();
                    FT800_setBackgroundColor(BLACK);
                    FT800_clear(CLEAR_ALL);
                    FT800_drawText(205, 20, 23, WHITE, OPT_FLAT, "Loading..."); 
                    FT800_drawAnimSpinner(240,136,0,1);
                    FT800_endOfList();
                    sprintf((char*)path, "%s/%s", jpg_folder, jpgs[jpg_num]); 
                    FT800_loadJPGfromSD(0,path,&img_width,&img_height);
                    strcpy(wallpaper_folder,jpg_folder);
                    strcpy(wallpaper,jpgs[jpg_num]);
                }
                previous_menu=JPG;

                FT800_finishList();
                FT800_startNewList();
                FT800_setBackgroundColor(BLACK);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                FT800_stop();
                FT800_bitmapSource(0);      
                FT800_bitmapLayout(RGB565, img_width*2, img_height);   
                FT800_bitmapSize(NEAREST,BORDER,BORDER, img_width, img_height); 
                FT800_bitmapBegin(); 
                FT800_Vertex2II(0,0,0,0); 
                
                FT800_setColorA(100);
                FT800_drawButton(445,5,30,30,LIGHTGRAY,28,OPT_3D,"X",BLACK, MAIN_MENU);
                FT800_drawButton(190,230,40,40,LIGHTGRAY,30,OPT_3D,"<",BLACK, BACKWARD);
                FT800_drawButton(250,230,40,40,LIGHTGRAY,30,OPT_3D,">",BLACK, FORWARD);
                FT800_setColorA(255);
                
                FT800_endOfList();   
                break;   
            case TRANSFORM: 
                if(previous_menu==MAIN_MENU)
                {    
                    FT800_finishList();
                    FT800_startNewList();
                    FT800_setBackgroundColor(BLACK);
                    FT800_clear(CLEAR_ALL);
                    FT800_endOfList();
                    sprintf((char*)path, "%s/%s",bmp_folder, "mario.bmp");   
                    FT800_loadBMPfromSD(0,path , &img_width, &img_height, &img_bytes);
                }
                previous_menu=TRANSFORM;
                
                FT800_finishList();
                FT800_startNewList();
                FT800_setBackgroundColor(BLACK);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                
