OptoLAB/FT800-Demo-for-PIC32-and-STM32/FT800 MINI PIC32MX/FT800_MINI_PIC32MX.X/src/main.c
                FT800_drawScrollBar(20, 55, 20, 200, DARKGRAY, ORANGE, OPT_3D, scale_factor, 1, 4, SCROLL_S);
                FT800_drawScrollBar(450, 55, 20, 200, DARKGRAY, ORANGE, OPT_3D, rotate_factor, 10, 1024, SCROLL_R);
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 scale and rotate");
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);                
  
                
                FT800_loadIdentity();
                FT800_scale(scale_factor+1,scale_factor+1);
                FT800_translate((img_width>>1),(img_height>>1));
                FT800_rotate((rotate_factor*360)/1023);
                FT800_translate(-(img_width>>1),-(img_height>>1));
                FT800_setMatrix();

                
                FT800_bitmapSource(0);      
                FT800_bitmapLayout(RGB565, img_width*img_bytes, img_height);   
                FT800_bitmapSize(NEAREST,BORDER,BORDER, img_width*(scale_factor+1), img_height*(scale_factor+1)); 
                FT800_bitmapBegin(); 
                FT800_Vertex2II((DISPLAY_WIDTH>>1)-(((scale_factor+1)*img_width)>>1),(DISPLAY_HEIGHT>>1)-(((scale_factor+1)*img_height)>>1),0,0); 
                
                FT800_endOfList();
                break;  
            case SKETCH: 
                FT800_finishList();
                FT800_startNewList();
                FT800_setBackgroundColor(BLACK);
                FT800_clear(CLEAR_ALL);
                FT800_tagMask(0);
                if(previous_menu==MAIN_MENU)
                {
                    FT800_writeMemZero(0, 480 * 272 * 2); 
                }
                previous_menu=SKETCH;
                FT800_drawText(5, 5, 18, ORANGE, OPT_FLAT, "FT800 sketch");
                FT800_drawButton(445,5,30,30,RED,28,OPT_3D,"X",WHITE, MAIN_MENU);                
  
                    
                  FT800_drawSketch(0, 0, 480, 272, 0, L1);  

                    
                
                FT800_bitmapSource(0);     
                FT800_bitmapLayout(L1, 480/8, 272);   
                FT800_bitmapSize(NEAREST,BORDER,BORDER, 480, 272); //92 48
                FT800_bitmapBegin(); 
                FT800_Vertex2II(0,0,0,0);                 

                FT800_endOfList();
                break; 
            case SCRSAVER: 
                if(previous_menu==MAIN_MENU)
                {
                    FT800_finishList();
                    FT800_startNewList();
                    FT800_setBackgroundColor(BLACK);
                    FT800_clear(CLEAR_ALL);
                    FT800_endOfList();
                    sprintf((char*)path, "%s/%s",bmp_folder, "mario.bmp");   
                    FT800_loadBMPfromSD(0,path , &img_width, &img_height, &img_bytes);     
                }
                previous_menu=SCRSAVER;
        
                FT800_finishList();
                FT800_startNewList();
                FT800_setBackgroundColor(BLACK);
                FT800_clear(CLEAR_ALL);
                FT800_track(0, 0, 480, 272, MAIN_MENU);

                FT800_drawScreensaver();

                FT800_loadIdentity();
                FT800_scale(2,2);
                FT800_setMatrix();

                FT800_bitmapSource(0);      
                FT800_bitmapLayout(RGB565, img_width*img_bytes, img_height); 
                FT800_bitmapSize(NEAREST,BORDER,BORDER, img_width*2, img_height*2); 
                FT800_bitmapBegin(); 
                
                FT800_macro(0);
                FT800_endOfList();
                  
                break; 
        }        
        if(touched)
        {
            touched=0;
            FT800_clearIntFlags();
            tag = FT800_readTag();
            
            if(tag)
            {            
                if(tag&0x80)
                {
                    mute=0;
                    menu=tag;
                }
                else
                {
                    switch(tag)
                    {
                        case SLIDER: 
                            slider_value=FT800_readValue()>>6; 
                            break;
                        case SCROLL_V: 
                            scroll_v_value=FT800_readValue()>>8; 
                            break;   
                        case SCROLL_H: 
                            scroll_h_value=FT800_readValue()>>7; 
                            break;  
                        case DIAL: 
                            dial_value=FT800_readValue(); 
                            break;  
                        case TOGGLE: 
                            toggle_value=FT800_readValue(); 
                            break;  
                        case KEY: 
                            break; 
                        case NOTES:
                            break;   
                        case SLIDER1: 
                            mute=0; slider_value=FT800_readValue()>>6; 
                            break;  
                        case FORWARD: 
                            if(menu==BMP)
                            {
                                if(bmp_num==(NUM_OF_BMPS-1))bmp_num=0;
                                else bmp_num++;
                            }
                            if(menu==JPG)
                            {
                                if(jpg_num==(NUM_OF_JPGS-1))jpg_num=0;
                                else jpg_num++;
                            }
                            new_file=1;
                            break;
                          case BACKWARD: 
                            if(menu==BMP)
                            {
                                if(bmp_num==0)bmp_num=NUM_OF_BMPS-1;
                                else bmp_num--;
                            }
                            if(menu==JPG)
                            {
                                if(jpg_num==0)jpg_num=NUM_OF_JPGS-1;
                                else jpg_num--;
                            }                            
                            new_file=1;
                            break; 
                        case NEXT:
                            if(wav_num==(NUM_OF_WAVS-1))wav_num=0;
                            else wav_num++;
                            new_file=1;     
                            break;
                        case PREVIOUS:
                            if(wav_num==0)wav_num=NUM_OF_WAVS-1;
                            else wav_num--;
                            new_file=1;
                            break;
                        case PLAY:    
                            FT800_configurePlayback(0, wav_size, wav_sample_rate, wav_format, 0);
                            FT800_playPlayback(1); 
                            break;    
                        case SLIDER2:
                            slider_value=FT800_readValue()>>6; 
                            FT800_setPlaybackVolume(slider_value>>2);
                            break;
                        case SCROLL_S: 
                            scale_factor=FT800_readValue()>>14; 
                            break;   
                        case SCROLL_R: 
                            rotate_factor=FT800_readValue()>>6; 
                            break;  
                    }  
                }
                if(!mute)
                {
                    FT800_setSoundVolume(255);
                    FT800_setSoundEffect(0x6C,0x50);
                    FT800_playSound(1);
                    //while(FT800_isSoundPlaying());
                }
                    
            }
        }
        //for clock testing
        ms+=20;
        if(ms==1000)
        {
            ms=0;
            sec++;
            if(sec==60)
            {
                sec=0;
                min++;
                if(min==60)
                {
                    min=0;
                    hour++;
                    if(hour==12)hour=0;
                }
            }
        }


    }
}

